=========================================================================================================
Layer (type:depth-idx)                                  Output Shape              Param #
=========================================================================================================
EfficientNet                                            [64, 100]                 --
├─Sequential: 1-1                                       [64, 1280, 7, 7]          --
│    └─Conv2dNormActivation: 2-1                        [64, 32, 112, 112]        --
│    │    └─Conv2d: 3-1                                 [64, 32, 112, 112]        864
│    │    └─BatchNorm2d: 3-2                            [64, 32, 112, 112]        64
│    │    └─SiLU: 3-3                                   [64, 32, 112, 112]        --
│    └─Sequential: 2-2                                  [64, 16, 112, 112]        --
│    │    └─MBConv: 3-4                                 [64, 16, 112, 112]        1,448
│    └─Sequential: 2-3                                  [64, 24, 56, 56]          --
│    │    └─MBConv: 3-5                                 [64, 24, 56, 56]          6,004
│    │    └─MBConv: 3-6                                 [64, 24, 56, 56]          10,710
│    └─Sequential: 2-4                                  [64, 40, 28, 28]          --
│    │    └─MBConv: 3-7                                 [64, 40, 28, 28]          15,350
│    │    └─MBConv: 3-8                                 [64, 40, 28, 28]          31,290
│    └─Sequential: 2-5                                  [64, 80, 14, 14]          --
│    │    └─MBConv: 3-9                                 [64, 80, 14, 14]          37,130
│    │    └─MBConv: 3-10                                [64, 80, 14, 14]          102,900
│    │    └─MBConv: 3-11                                [64, 80, 14, 14]          102,900
│    └─Sequential: 2-6                                  [64, 112, 14, 14]         --
│    │    └─MBConv: 3-12                                [64, 112, 14, 14]         126,004
│    │    └─MBConv: 3-13                                [64, 112, 14, 14]         208,572
│    │    └─MBConv: 3-14                                [64, 112, 14, 14]         208,572
│    └─Sequential: 2-7                                  [64, 192, 7, 7]           --
│    │    └─MBConv: 3-15                                [64, 192, 7, 7]           262,492
│    │    └─MBConv: 3-16                                [64, 192, 7, 7]           587,952
│    │    └─MBConv: 3-17                                [64, 192, 7, 7]           587,952
│    │    └─MBConv: 3-18                                [64, 192, 7, 7]           587,952
│    └─Sequential: 2-8                                  [64, 320, 7, 7]           --
│    │    └─MBConv: 3-19                                [64, 320, 7, 7]           717,232
│    └─Conv2dNormActivation: 2-9                        [64, 1280, 7, 7]          --
│    │    └─Conv2d: 3-20                                [64, 1280, 7, 7]          409,600
│    │    └─BatchNorm2d: 3-21                           [64, 1280, 7, 7]          2,560
│    │    └─SiLU: 3-22                                  [64, 1280, 7, 7]          --
├─AdaptiveAvgPool2d: 1-2                                [64, 1280, 1, 1]          --
├─Sequential: 1-3                                       [64, 100]                 --
│    └─Dropout: 2-10                                    [64, 1280]                --
│    └─Linear: 2-11                                     [64, 100]                 128,100
=========================================================================================================
Total params: 4,135,648
Trainable params: 4,135,648
Non-trainable params: 0
Total mult-adds (G): 24.62
=========================================================================================================
Input size (MB): 38.54
Forward/backward pass size (MB): 6904.23
Params size (MB): 16.54
Estimated Total Size (MB): 6959.31
=========================================================================================================